Revit 2027 API
ParameterTypeId.IfcExportElementType Property
 "Export Type to IFC"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId IfcExportElementType { get; }
Public Shared ReadOnly Property IfcExportElementType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ IfcExportElementType {
	ForgeTypeId^ get ();
}
static member IfcExportElementType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace